import 'package:flutter/material.dart';
import 'package:quraan/font_size/font_size.dart';

class Ad3yaScreen extends StatelessWidget {
  const Ad3yaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return const Scaffold(
      body: SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.symmetric(horizontal: 16.0, vertical: 50),
          child: Text(
            '''سبحان الله عدد ماخلق
سبحان الله ملء ماخلق
سبحان الله عدد مافي السموات والارض
سبحان الله ملء مافي السموات و الارض
سبحان الله عدد ما احصى كتابه
سبحان الله ملء ما احصى كتابه
سبحان الله عدد كل شيء
سبحان الله ملء كل شيء

الحمد لله عدد ماخلق
الحمد لله ملء ماخلق
الحمد لله عدد مافي السموات والارض
الحمد لله ملء مافي السموات والارض
الحمد لله عدد ما احصى كتابه
الحمد لله ملء ما احصى كتابه 
الحمد لله عدد كل شيء
الحمد لله ملء كل شيء

الله اكبر عدد ماخلق
الله اكبر ملء ماخلق
الله اكبر عدد مافي السموات والارض
الله اكبر ملء مافي السموات والارض
الله اكبر عدد ما احصى كتابه 
الله اكبر ملء ما احصى كتابه
الله اكبر عدد كل شيء
الله اكبر ملء كل شيء

لا إله إلا الله عدد ماخلق
لا إله إلا الله ملء ماخلق
لا إله إلا الله عدد مافي السموات والارض
لا إله إلا الله ملء مافي السموات والارض
لا إله إلا الله عدد ما احصى كتابه
لا إله إلا الله ملء ما احصى كتابه
لا إله إلا الله عدد كل شيء 
لا إله إلا الله ملء كل شيء

لا حول ولا قوة إلا بالله عدد ماخلق
لاحول ولا قوة إلا بالله ملء ماخلق
لاحول ولاقوة إلا بالله عدد مافي السموات والارض
لاحول ولاقوة إلا بالله ملء مافي السموات والارض
لاحول ولا قوة إلا بالله عدد ما احصى كتابه
لاحول ولاقوة إلا بالله ملء ما احصى كتابه
لا حول ولاقوة إلا بالله عدد كل شيء
لا حول ولاقوة إلا بالله ملء كل شيء

استغفر الله عدد ماخلق 
استغفر الله ملء ماخلق
استغفر الله عدد مافي السموات والارض
استغفر الله ملء مافي السموات والارض
استغفر الله عدد ما احصى كتابه 
استغفر الله ملء ما احصى كتابه 
استغفر الله عدد كل شيء
استغفر الله ملء كل شيء وااللهم صل وسلم على سيدنا محمد وعلى اله وسلم مثل ذلك وعدد ماذكره الذاكرون وغفل عن ذكره الغافلون وعدد ماكان ومايكون وعدد الحركات والسكون وعدد مااحاط به علمك وخط به قلمك واحصاه كتابك  وعدد ماعلم الله وملء ماعلم الله وزنه ماعلم الله وملء ماعلم الله وملء الميزان ومنتهى العلم ومبلغ الرضى وزنه العرش
لّا إِلَهَ إِلاَّ أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ  أسْتَغـفِرُ اللّه الـذيْ لا إلـهَ إلّا هُـوَ الحـيُّ القيّـومْ وأَتُوب اليه.... اللّهُمّ اغْفرْ للمؤمنِينَ والمؤمِنات وَالمُسلمينَ والمُسلماتْ الأحيَاء منهُمْ والأمواتْ...  رَبّنـا آتِنَـا فيْ الدُّنيَــا حسنةً وفيْ الآخرَة حسنةً وقِـنا عذاب النّـار...  سُبحَان اللّـه وبحمدهِ عَدَدَ خلْقِه ورضَا نفسه و زِنَة عرشه ومِدادَ كلماتـه.. سُبحَان اللّـه وبحمدهِ عَدَدَ خلْقِه ورضَا نفسه و زِنَة عرشه ومِدادَ كلماتـه. سُبحَان اللّـه وبحمدهِ عَدَدَ خلْقِه ورضَا نفسه و زِنَة عرشه ومِدادَ كلماتـه.. لاحَوْلَ ولاقُوّة إلا باللّه . لاحَوْلَ ولاقُوّة إلا باللّه . لاحَوْلَ ولاقُوّة إلا باللّه ..  ( اللهم ارحمني برحمتك )  ( اللهم ارحمني برحمتك )  ( اللهم ارحمني برحمتك )  ( اللهم أحسن خاتمتي )  ( اللهم أحسن خاتمتي )  ( اللهم أحسن خاتمتي )  ( اللهم أعني على طاعتك )  (اللهم أعني على طاعتك )  ( اللهم أعني على طاعتك ) (اللهم لا تدع لي ذنبا الا غفرته ولا دينا الا قضيته ولا هما الا فرجته ولا حاجة من حوائج الدنيا والاخره الا قضيتها يا الله )
(سبحان الله) (والحمد لله) (ولا إله إلا الله)(والله أكبر) (سبحان الله وبحمده) (سبحان الله العظيم) 
اللهم أجبر قلبي جبراً يتعجب منه أهل السموات والأرض , جبراً يليق بكرمك و عظمتك و قدرتك يا ربّ 
اللهم أجبر قلبي جبراً يتعجب منه أهل السموات والأرض ,جبراً يليق بكرمك وعظمتك وقدرتك يا رب 
اللهم أجبر قلبي جبراً يتعجب منه أهل السموات والأرض ،جبراً يليق بكرمك وعظمتك وقدرتك يا رب
اللهم إنا نسألك باسمك العظيم الأعظم، الذي إذا دعيت به أجبت، وإذا سئلت به أعطيت، وبأسمائك الحسنى كلها ما علمنا منها وما لم نعلم، أن تستجيب لنا دعواتنا، وتحقق رغباتنا، وتقضي حوائجنا، وتفرج كروبنا، وتغفر ذنوبنا، وتستر عيوبنا، وتتوب علينا، وتعافينا وتعفو عنا، وتصلح أهلينا وذريتنا، وترحمنا برحمتك الواسعة، رحمة تغنينا بها عن رحمة من سواك. 
اللهم اكفنا بحلالك عن حرامك، وأغننا بفضلك عمن سواك. 
اللهم إني أسالك يا ألله بأنك الواحد الأحد الصمد، الذي لم يلد ولم يولد، ولم يكن له كفواً أحد، أن تغفر لي ذنوبي، إنك أنت الغفور الرحيم. 
اللهم إني أسالك أن ترفع ذِكري، وتضع وزري، وتُصلح أمري، وتغفر لي ذنبي. 
اللهم إني أسالك إيماناً لا يرتد، ونعيماً لا ينفد، ومرافقة نبينامحمد (صل الله عليه و آله وسلم) في أعلى جنة الخلد.6- اللهم حبب إلينا الإيمان وزينه في قلوبنا، وكره إلينا الكفر والفسوق والعصيان، واجعلنا من الراشدين. 
اللهم توفنا مسلمين، وأحينا مسلمين، وألحقنا بالصالحين، غير خزايا ولا مفتونين. 
اللهم زدنا ولا تنقصنا، وأكرمنا ولا تهنا، وأعطنا ولا تحرمنا، وآثرنا ولا تؤثر علينا، وأرضنا وارض عنا. 
اللهم أقل عثراتنا، واغفر زلاتنا، وكفر عنا سيئاتنا، وتوفنا مع الأبرار، يا عزيز يا غفار.
اللهم عافني في روحي وفي جسدي، وفي قلبي وفي بدني، وفي صحتي وفي قوتي، وعافني في دنياي وآخرتي. 
اللهم إني أعوذ بك من عقوق الأبناء، ومن قطيعة الأقرباء، ومن جفوة الأحياء، ومن تغير الأصدقاء. 
اللهم إني أعوذ بك من قلب لا يخشع، ومن دعاء لا يسمع، ومن نفس لا تشبع، ومن علم لا ينفع، اللهم إني أعوذ بك من هؤلاء الأربع.
''',
            style: TextStyle(
              fontSize: kFontSize,
              fontWeight: FontWeight.bold,
            ),
            textAlign: TextAlign.right,
          ),
        ),
      ),
    );
  }
}
